{
  "backend/main.mo": "Motoko canister storing character profiles with access control and functions to save and retrieve profiles.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global background/foreground styling.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app managing navigation between landing, customization, and game screens with audio and toasts.",
  "frontend/src/audio/AudioProvider.tsx": "Audio context managing background music, volume, mute state, persistence, and playback controls.",
  "frontend/src/game/biomes/BiomeEnvironment.tsx": "R3F component configuring sky, fog, lights, and props for the active biome environment.",
  "frontend/src/game/biomes/biomes.ts": "Defines biome types and config objects for forest, desert, and mountains with lighting and color settings.",
  "frontend/src/game/biomes/useBiomeStore.ts": "Zustand store managing the current biome and allowing biome changes.",
  "frontend/src/game/combat/combatTypes.ts": "Defines combat entities and functions for applying damage and healing.",
  "frontend/src/game/combat/useCombatState.ts": "React hook managing player health with damage and healing helpers.",
  "frontend/src/game/controls/useFirstPersonControls.ts": "Implements first-person movement and rotation using keyboard, mouse, and collision‑bounded updates.",
  "frontend/src/game/entities/HostileCreature.tsx": "React component for an enemy creature with movement AI, attack timing, animations, and a health bar.",
  "frontend/src/game/entities/NPC.tsx": "Renders an NPC that reacts to player proximity and triggers biome‑specific dialogue interactions.",
  "frontend/src/game/entities/useCreatureAI.ts": "Provides simple AI for creatures, determining attack state and movement toward the player.",
  "frontend/src/game/interactions/useInteractionStore.ts": "Zustand store for interaction state, dialogue flow, and interaction availability.",
  "frontend/src/game/physics/collision.ts": "Utilities for AABB collision checks, clamping positions, and computing distances.",
  "frontend/src/game/SpellheimCanvas.tsx": "Main React Three Fiber game canvas containing physics, player controls, spells, AI creatures, NPCs, and biome environment.",
  "frontend/src/game/spells/SpellEffects.tsx": "Renders projectile, area, and shield spell effects with animations and hit callbacks.",
  "frontend/src/game/spells/spellTypes.ts": "Defines available spells with metadata such as cost, cooldown, and keybinds.",
  "frontend/src/game/spells/useSpellSystem.ts": "Manages mana regen, spell casting, and cooldown timers with keyboard input handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's character profile through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom fantasy-themed color variables and component classes for panels, buttons, and headings.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider.",
  "frontend/src/screens/CharacterCustomizationScreen.tsx": "UI screen for editing a character's name, archetype, and cosmetic attributes, saving updates via state hooks.",
  "frontend/src/screens/GameScreen.tsx": "Renders the game canvas, HUD, and a modal for character customization with pointer lock tracking.",
  "frontend/src/screens/LandingScreen.tsx": "Landing page that displays the logo, description, controls, and start button for entering the game.",
  "frontend/src/state/characterProfile.ts": "Defines the CharacterProfile type, default values, and simple profile validation.",
  "frontend/src/state/useCharacterProfile.ts": "Hook that loads, stores, and updates the character profile from local storage and optionally the backend.",
  "frontend/src/ui/Auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and clears or refreshes queries on state changes.",
  "frontend/src/ui/dialogue/DialoguePanel.tsx": "Dialogue UI displaying current NPC text with next/close controls and a dismiss button.",
  "frontend/src/ui/HUD/AudioControls.tsx": "Audio control UI with play/pause, mute, and volume slider tied to the audio provider.",
  "frontend/src/ui/HUD/BiomeSwitcher.tsx": "Dropdown UI for selecting and updating the current biome from available biome configurations.",
  "frontend/src/ui/HUD/HUDOverlay.tsx": "Main HUD container showing player status, spells, prompts, dialogue, settings, and profile info with pointer-lock messaging.",
  "frontend/src/ui/HUD/InteractionPrompt.tsx": "Displays an on-screen prompt to press E when the player can interact and no dialogue is active.",
  "frontend/src/ui/HUD/SpellBar.tsx": "Renders equipped spells with icons, cooldown overlays, keybinds, and mana info.",
  "frontend/src/ui/HUD/StatusBars.tsx": "Shows health and mana bars with icons and numerical values using progress components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in session storage, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "JSON file describing the game's project state, features, requirements, and image assets."
}